Documents/ОтражениеЗарплатыВФинансовомУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОтражениеЗарплатыВФинансовомУчете</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыплатаОтпусковЗаСчетРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводкиПоРаботникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарплатаОтраженаВБухучете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачисленнаяЗарплатаИВзносы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПредприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияЗарплатыВБухучете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВзносыВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУчетаНачислений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленнаяЗарплатаИВзносыПоФизлицам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПредприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияЗарплатыВБухучете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВзносыВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУчетаНачислений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленныйНДФЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПредприятия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНалога</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУчетаНачислений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдержаннаяЗарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПредприятия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУчетаНачислений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленныеОтпускаЗаСчетРезерва</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховыеВзносы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФССНесчастныеСлучаи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленныеПроцентыПоЗаймам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПредприятия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыПоЗаймамСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоЗаймамСотрудникам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВнеочередноеПогашение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорЗайма</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорЗаймаСотруднику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОтражениеЗарплатыВФинансовомУчете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании, Параметры) Экспорт



КонецПроцедуры

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Возвращает строку с наименованием колонок взносов, через запятую.
// 
// Возвращаемое значение:
//   Строка
//
Функция КолонкиДляСуммирования() Экспорт
	
	Возврат "ВзносыВсего";	
		
КонецФункции

// Процедура заполняет структуру данных для заполнения документа отражения зарплаты.
// 
// Параметры:
//   СтруктураПараметров - Структура - параметры заполнения, содержит имена таблиц, организацию и период регистрации.
//   АдресХранилища - Строка - Адрес хранилища для помещения результата заполнения.
//
Процедура ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища) Экспорт
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляЗаполнения = Новый Структура;
	
	// получим отражение в учете
	УстановитьПривилегированныйРежим(Истина);
	ДанныеДляОтражения = ОтражениеЗарплатыВБухучете.ДанныеДляОтраженияЗарплатыВБухучете( 
		СтруктураПараметров.ПериодРегистрации,
		СтруктураПараметров.Организация,
		СтруктураПараметров.СтрокаСписокТаблиц);
	
	ВыделитьОтпускаЗаСчетОценочныхОбязательств(ДанныеДляОтражения, СтруктураПараметров);
	
	ДобавитьПолеПодразделениеПредприятия(ДанныеДляОтражения, СтруктураПараметров);
	
	// Сведения о начисленных процентах по займам, погашенным через кассу или безналичным платежом.
	Если ДанныеДляОтражения.Свойство("УдержаннаяЗарплата") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Организация КАК Организация,
		|	ВзаиморасчетыПоЗаймамСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ВзаиморасчетыПоЗаймамСотрудникам.Проценты) КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму) КАК ВидОперации
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам КАК ВзаиморасчетыПоЗаймамСотрудникам
		|ГДЕ
		|	ВзаиморасчетыПоЗаймамСотрудникам.Организация = &Организация
		|	И (ВзаиморасчетыПоЗаймамСотрудникам.Регистратор ССЫЛКА Документ.ПогашениеЗаймаСотруднику)
		|	И ВзаиморасчетыПоЗаймамСотрудникам.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВзаиморасчетыПоЗаймамСотрудникам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыПоЗаймамСотрудникам.ФизическоеЛицо";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураПараметров.ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(СтруктураПараметров.ПериодРегистрации));
		Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ДанныеДляОтражения.УдержаннаяЗарплата.Добавить(), Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеДляЗаполнения.Вставить("РезультатОтраженияЗарплаты", ДанныеДляОтражения);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

// Процедура дополнительной обработки данных перед отражением в учете.
// 
// Параметры:
//   Объект - ДанныеФормыСтруктура, Структура - объект, в который будет помещен результат
//   Параметры - Структура - дополнительные параметры обработки
//   ЗаполнитьСводнуюТаблицу - Булево - Истина, если требуется заполнить сводную таблицу начислений
//
Процедура ЗаполнениеПослеВыполненияДлительнойОперации(Объект, Параметры, ЗаполнитьСводнуюТаблицу = Истина) Экспорт
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	
	РезультатОтраженияЗарплаты = Неопределено;
	Если СтруктураДанных.Свойство("РезультатОтраженияЗарплаты", РезультатОтраженияЗарплаты) Тогда
		
		Параметры.ТекстОповещения = НСтр("ru='Заполнено строк';uk='Заповнено рядків'");
		
		Если РезультатОтраженияЗарплаты.Свойство("НачисленнаяЗарплатаИВзносы") И РезультатОтраженияЗарплаты.НачисленнаяЗарплатаИВзносы.Количество() > 0 Тогда
			
			Для Каждого Строка Из РезультатОтраженияЗарплаты.НачисленнаяЗарплатаИВзносы Цикл
				
				ВзносыВсего = Строка.ВзносыВсего;
				Если ВзносыВсего = 0 И Строка.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Объект.НачисленнаяЗарплатаИВзносыПоФизлицам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.ВзносыВсего = ВзносыВсего;
				
				Если Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы Тогда
					
					НоваяСтрока.СпособОтраженияЗарплатыВБухучете = Справочники.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка();
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗаполнитьСводнуюТаблицу Тогда
				
					КолонкаВидНачисления = "";
				
				ТаблицаИтоги = Объект.НачисленнаяЗарплатаИВзносыПоФизлицам.Выгрузить(,КолонкаВидНачисления + "ПодразделениеПредприятия, ВидОперации, СпособОтраженияЗарплатыВБухучете,ГруппаУчетаНачислений,Налог,
					|Сумма, ВзносыВсего");
					
				ТаблицаИтоги.Свернуть(КолонкаВидНачисления + "ПодразделениеПредприятия, ВидОперации, СпособОтраженияЗарплатыВБухучете,ГруппаУчетаНачислений, Налог",
					"Сумма, ВзносыВсего");
					
				ТаблицаИтоги.Сортировать("ПодразделениеПредприятия");
				
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаИтоги, Объект.НачисленнаяЗарплатаИВзносы);
				
				Если Объект.НачисленнаяЗарплатаИВзносы.Количество() > 0 Тогда
					
					Параметры.ЕстьДанныеДляЗаполнения = Истина;
					
					Параметры.ПояснениеОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Начисленния: %1';uk='Нарахування: %1'"),
						Объект.НачисленнаяЗарплатаИВзносы.Количество());
					
				КонецЕсли;
				
				Если Параметры.Сводно Тогда
					Объект.НачисленнаяЗарплатаИВзносыПоФизлицам.Очистить();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если РезультатОтраженияЗарплаты.Свойство("НачисленныйНДФЛ") И РезультатОтраженияЗарплаты.НачисленныйНДФЛ.Количество() > 0 Тогда
			
			Если Параметры.Сводно Тогда
				ТаблицаИтогиНДФЛ = РезультатОтраженияЗарплаты.НачисленныйНДФЛ.Скопировать(, "ПодразделениеПредприятия, Сумма, ВидОперации, КодДохода, ГруппаУчетаНачислений");
				ТаблицаИтогиНДФЛ.Свернуть("ПодразделениеПредприятия, ВидОперации, КодДохода, ГруппаУчетаНачислений", "Сумма");
				ТаблицаИтогиНДФЛ.Сортировать("ВидОперации, КодДохода");
			Иначе
				ТаблицаИтогиНДФЛ = РезультатОтраженияЗарплаты.НачисленныйНДФЛ.Скопировать(, "ФизическоеЛицо, ПодразделениеПредприятия, Сумма, ВидОперации, КодДохода, ГруппаУчетаНачислений");
				ТаблицаИтогиНДФЛ.Свернуть("ФизическоеЛицо, ПодразделениеПредприятия, ВидОперации, КодДохода, ГруппаУчетаНачислений", "Сумма");
				ТаблицаИтогиНДФЛ.Сортировать("ФизическоеЛицо, ВидОперации, КодДохода");
			КонецЕсли;
			
			Для Каждого Строка Из ТаблицаИтогиНДФЛ Цикл
				
				Если Строка.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(Объект.НачисленныйНДФЛ.Добавить(), Строка);
			КонецЦикла;
			
			Если Объект.НачисленныйНДФЛ.Количество() > 0 Тогда
				
				Если ЗначениеЗаполнено(Параметры.ПояснениеОповещения) Тогда
					Параметры.ПояснениеОповещения = Параметры.ПояснениеОповещения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru=', НДФЛ: %1';uk=', ПДФО: %1'"),
						Объект.НачисленныйНДФЛ.Количество());
				Иначе
					Параметры.ПояснениеОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='НДФЛ: %1';uk='ПДФО: %1'"),
						Объект.НачисленныйНДФЛ.Количество());
				КонецЕсли;
				
				Параметры.ЕстьДанныеДляЗаполнения = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(Объект) = Тип("Структура") Тогда
			УдержаннаяЗарплата = Объект.УдержаннаяЗарплата.Скопировать();
			НачисленныеПроцентыПоЗаймам = Объект.НачисленныеПроцентыПоЗаймам.Скопировать();
		Иначе
			УдержаннаяЗарплата = Объект.УдержаннаяЗарплата.Выгрузить();
			НачисленныеПроцентыПоЗаймам = Объект.НачисленныеПроцентыПоЗаймам.Выгрузить();
		КонецЕсли;
		
		Если РезультатОтраженияЗарплаты.Свойство("УдержаннаяЗарплата")
			И РезультатОтраженияЗарплаты.УдержаннаяЗарплата.Количество() > 0 Тогда
			
			Для Каждого Строка Из РезультатОтраженияЗарплаты.УдержаннаяЗарплата Цикл
				
				Если Строка.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоПроцентовПоЗайму Тогда
					ЗаполнитьЗначенияСвойств(НачисленныеПроцентыПоЗаймам.Добавить(), Строка);
				Иначе
					НоваяСтрока = УдержаннаяЗарплата.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		ТаблицыДляЗаполненияСтатейПоУмолчанию = "";
		
		Если СтрНайти(Параметры.СтрокаСписокТаблиц, "УдержаннаяЗарплата") > 0 Тогда
			
			Если УдержаннаяЗарплата.Количество() > 0 И Параметры.ЗаполнятьАналитики Тогда
				
				Если ТипЗнч(Объект) = Тип("Структура") Тогда
					Объект.УдержаннаяЗарплата = УдержаннаяЗарплата;
				Иначе
					Объект.УдержаннаяЗарплата.Загрузить(УдержаннаяЗарплата);
				КонецЕсли;
				
				ТаблицыДляЗаполненияСтатейПоУмолчанию = "УдержаннаяЗарплата";
				
				Если ЗначениеЗаполнено(Параметры.ПояснениеОповещения) Тогда
					Параметры.ПояснениеОповещения = Параметры.ПояснениеОповещения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru=', удержанния: %1';uk=', утримання: %1'"),
						Объект.УдержаннаяЗарплата.Количество());
				Иначе
					Параметры.ПояснениеОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Удержанния: %1';uk='Утримання: %1'"),
						Объект.УдержаннаяЗарплата.Количество());
				КонецЕсли;
				
				Параметры.ЕстьДанныеДляЗаполнения = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрНайти(Параметры.СтрокаСписокТаблиц, "НачисленныеПроцентыПоЗаймам") > 0 Тогда
			
			Если НачисленныеПроцентыПоЗаймам.Количество() > 0 И Параметры.ЗаполнятьАналитики Тогда
				
				Если ТипЗнч(Объект) = Тип("Структура") Тогда
					Объект.НачисленныеПроцентыПоЗаймам = НачисленныеПроцентыПоЗаймам;
				Иначе
					Объект.НачисленныеПроцентыПоЗаймам.Загрузить(НачисленныеПроцентыПоЗаймам);
				КонецЕсли;
				
				ТаблицыДляЗаполненияСтатейПоУмолчанию = ТаблицыДляЗаполненияСтатейПоУмолчанию + ", " + "НачисленныеПроцентыПоЗаймам";
				
				Если ЗначениеЗаполнено(Параметры.ПояснениеОповещения) Тогда
					Параметры.ПояснениеОповещения = Параметры.ПояснениеОповещения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru=', проценты по займам: %1';uk=' відсотки по позиках: %1'"),
						Объект.НачисленныеПроцентыПоЗаймам.Количество());
				Иначе
					Параметры.ПояснениеОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Проценты по займам: %1';uk='Відсотки за позиками: %1'"),
						Объект.НачисленныеПроцентыПоЗаймам.Количество());
				КонецЕсли;
				
				Параметры.ЕстьДанныеДляЗаполнения = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		////Если ЗначениеЗаполнено(ТаблицыДляЗаполненияСтатейПоУмолчанию) Тогда
		////	ЗаполнитьСтатьиАналитикуРасходовПоУмолчанию(Объект, ТаблицыДляЗаполненияСтатейПоУмолчанию);
		////КонецЕсли;
		
	КонецЕсли;
	
	Если Не Параметры.ЕстьДанныеДляЗаполнения Тогда
		Параметры.ТекстОповещения = НСтр("ru='Начисления не заполнены';uk='Нарахування не заповнені'");
		Параметры.ПояснениеОповещения = НСтр("ru='В информационной базе отсутствуют данные для заполнения.';uk='В інформаційній базі відсутні дані для заповнення.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

Процедура ДобавитьПолеПодразделениеПредприятия(ДанныеДляОтражения, СтруктураПараметров)
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("НачисленнаяЗарплатаИВзносы");
	ИменаТаблиц.Добавить("НачисленныйНДФЛ");
	ИменаТаблиц.Добавить("УдержаннаяЗарплата");
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
	
		КолонкаПодразделение = ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("Подразделение");
		Если КолонкаПодразделение <> Неопределено Тогда
			КолонкаПодразделение.Имя = "ПодразделениеПредприятия";
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы.Свернуть("ВидОперации,  ПериодПринятияРасходов, ПодразделениеПредприятия,
		|Сотрудник, СпособОтраженияЗарплатыВБухучете, СтатьяРасходов, СтатьяФинансирования, ФизическоеЛицо,ГруппаУчетаНачислений,Налог", "Сумма, ВзносыВсего");
		
	ДанныеДляОтражения.НачисленныйНДФЛ.Свернуть("ВидОперации, КодДохода, СтатьяРасходов, СтатьяФинансирования, ФизическоеЛицо, ГруппаУчетаНачислений, ПодразделениеПредприятия, Сотрудник", "Сумма");
		
	ДанныеДляОтражения.УдержаннаяЗарплата.Свернуть("ВидОперации, Контрагент, ПодразделениеПредприятия, Сотрудник, СтатьяРасходов,
		|СтатьяФинансирования, ФизическоеЛицо, ГруппаУчетаНачислений", "Сумма");
	
КонецПроцедуры

Процедура ВыделитьОтпускаЗаСчетОценочныхОбязательств(ДанныеДляОтражения, СтруктураПараметров)
	
	
	Если Не ДанныеДляОтражения.Свойство("НачисленнаяЗарплатаИВзносы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиРезервов = РезервОтпусков.НастройкиРезервовОтпусков(СтруктураПараметров.Организация, СтруктураПараметров.ПериодРегистрации);
	
	Если Не НастройкиРезервов.ФормироватьРезервОтпусковБУ Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкиРезервов.ФормироватьРезервОтпусковНУ Тогда
		ВидОперацииРезервы   = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы;
	Иначе
		ВидОперацииРезервы = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства;
	КонецЕсли;
	
	НачисленнаяЗарплатаИВзносы = ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы;
	
	КолонкиДляСуммированияСтрокой = КолонкиДляСуммирования();
	КолонкиДляСуммирования = Новый Структура(КолонкиДляСуммированияСтрокой);

	ТаблицаВыплатЗаСчетРезерва = ТаблицаВыплатЗаСчетРезерва(СтруктураПараметров);
	
	РаспределяемыеСтроки = НачисленнаяЗарплатаИВзносы.НайтиСтроки(Новый Структура("ВидОперации", Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск));
	
	ДопРаспределяемыеСтроки = НачисленнаяЗарплатаИВзносы.НайтиСтроки(Новый Структура("ВидОперации", Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РаспределяемыеСтроки, ДопРаспределяемыеСтроки);
	
	ОтборСотрудник = Новый Структура("Сотрудник");
	
	Для Каждого Строка Из РаспределяемыеСтроки Цикл
		
		ОтборСотрудник.Сотрудник = Строка.Сотрудник;
		
		ВыплатыЗаСчетРезерва = ТаблицаВыплатЗаСчетРезерва.НайтиСтроки(ОтборСотрудник);
		
		Если ВыплатыЗаСчетРезерва.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаВыплаты = ВыплатыЗаСчетРезерва[0];
		
		ВзносыПоСтроке = СтруктураВзносовПоСтроке(Строка, КолонкиДляСуммирования);
		
		// Распределение суммы БУ
		
		Если Строка.Сумма <= СтрокаВыплаты.СуммаВыбыло И ВзносыПоСтроке.ВзносыВсего <= СтрокаВыплаты.ВзносыВыбыло Тогда
			
			Если Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска Тогда
				Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства;
			Иначе
				Строка.ВидОперации = ВидОперацииРезервы;
			КонецЕсли;
			
			СтрокаВыплаты.СуммаВыбыло = СтрокаВыплаты.СуммаВыбыло - Строка.Сумма;
			СтрокаВыплаты.ВзносыВыбыло = СтрокаВыплаты.ВзносыВыбыло -  ВзносыПоСтроке.ВзносыВсего;
			
		ИначеЕсли Строка.Сумма > СтрокаВыплаты.СуммаВыбыло Или ВзносыПоСтроке.ВзносыВсего > СтрокаВыплаты.ВзносыВыбыло Тогда
			
			НоваяСтрока = НачисленнаяЗарплатаИВзносы.Вставить(НачисленнаяЗарплатаИВзносы.Индекс(Строка) + 1);
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , "Сумма, " + КолонкиДляСуммированияСтрокой);
			
			Если Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска Тогда
				НоваяСтрока.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства;
			Иначе
				НоваяСтрока.ВидОперации = ВидОперацииРезервы;
			КонецЕсли;
			
			СуммаНачисленоРезерв = Мин(Строка.Сумма, СтрокаВыплаты.СуммаВыбыло);
			НоваяСтрока.Сумма = СуммаНачисленоРезерв;
			Строка.Сумма = Строка.Сумма - НоваяСтрока.Сумма;
			
			СуммаВзносыРезерв    = Мин(ВзносыПоСтроке.ВзносыВсего, СтрокаВыплаты.ВзносыВыбыло);
			Распределение = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаВзносыРезерв, ВзносыПоСтроке.МассивВзносов);
			
			Если Распределение <> Неопределено Тогда
				Индекс = 0;
				Для Каждого Взнос Из КолонкиДляСуммирования Цикл
					НоваяСтрока[Взнос.Ключ] = Распределение[Индекс];
					Строка[Взнос.Ключ] = Строка[Взнос.Ключ] - НоваяСтрока[Взнос.Ключ];
					Индекс = Индекс + 1;
				КонецЦикла;
			КонецЕсли;
			
			СтрокаВыплаты.СуммаВыбыло = СтрокаВыплаты.СуммаВыбыло - СуммаНачисленоРезерв;
			СтрокаВыплаты.ВзносыВыбыло = СтрокаВыплаты.ВзносыВыбыло - СуммаВзносыРезерв;
			
			Если НастройкиРезервов.ФормироватьРезервОтпусковНУ И Строка.ВидОперации <> Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска Тогда
				Строка.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаВыплатЗаСчетРезерва(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Выплаты.Сотрудник КАК Сотрудник,
		|	СУММА(Выплаты.СуммаРезерваВыбылоОборот) КАК СуммаВыбыло,
		|	СУММА(Выплаты.СуммаРезерваСтраховыхВзносовВыбылоОборот) КАК ВзносыВыбыло
		|ИЗ
		|	РегистрНакопления.ВыплатаОтпусковЗаСчетРезерва.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК Выплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	Выплаты.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураПараметров.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(СтруктураПараметров.ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СтруктураВзносовПоСтроке(Строка, КолонкиДляСуммирования)
	
	ВзносыВсего = 0;
	МассивВзносов = Новый Массив;
	
	Для Каждого Колонка Из КолонкиДляСуммирования Цикл
		ВзносыВсего = ВзносыВсего + Строка[Колонка.Ключ];
		МассивВзносов.Добавить(Строка[Колонка.Ключ]);
	КонецЦикла;
	
	Возврат Новый Структура("ВзносыВсего, МассивВзносов", ВзносыВсего, МассивВзносов);
	
КонецФункции

#Область ОбновлениеИнформационнойБазы


// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ОписаниеОбработчиковОбновления(Обработчики) Экспорт

	
КонецПроцедуры 


#КонецОбласти


#КонецОбласти

#КонецЕсли
